app/views/patients/_form.html.haml

SELECT `medications`.* FROM `medications`
---
          %label
            = check_box_tag 'patient[medication_ids][]', medication.id, @patient.medications.include?(medication)