app/controllers/clinics_controller.rb

  def index

    @clinics = if !params[:q].blank?
      Clinic.where("name LIKE ? OR st_address LIKE ? OR city LIKE ? OR state LIKE ?", "%#{params[:q]}%", "%#{params[:q]}%", "%#{params[:q]}%", "%#{params[:q]}%")

    else
    @clinics = Clinic.all
---
SELECT `clinics`.* FROM `clinics`

  def show
    @clinic = Clinic.find params[:id]
    @patients = @clinic.patients
    @doctor = Doctor.new
    # @doctors = @clinic.doctors
    @doctors = if !params[:q2].blank?
      @clinic.doctors.where("doctor_name LIKE ?", "%#{params[:q2]}%")
---
SELECT  `clinics`.* FROM `clinics` WHERE `clinics`.`id` = 23 LIMIT 1
SELECT `patients`.* FROM `patients` WHERE `patients`.`clinic_id` = 23

  def create
    @clinic = Clinic.create my_params
---
INSERT INTO `clinics` (`name`, `st_address`, `city`, `state`, `created_at`, `updated_at`) VALUES ('New Clinic', '12345 St', 'Charleston', 'SC', '2015-02-25 19:09:05.766410', '2015-02-25 19:09:05.766410')

  def edit
    @clinic = Clinic.find params[:id]
---
SELECT  `clinics`.* FROM `clinics` WHERE `clinics`.`id` = 29 LIMIT 1

  def update
    @clinic = Clinic.find params[:id]
    if @clinic.update my_params
---
SELECT  `clinics`.* FROM `clinics` WHERE `clinics`.`id` = 1 LIMIT 1
UPDATE `clinics` SET `name` = 'Updated Clinic Name', `st_address` = 'Updated Street', `city` = 'Updated City', `state` = 'NC', `updated_at` = '2015-02-25 21:07:59.715913' WHERE `clinics`.`id` = 1

  def destroy
    @clinic = Clinic.find params[:id]
    @clinic.destroy
---
SELECT  `clinics`.* FROM `clinics` WHERE `clinics`.`id` = 1 LIMIT 1
DELETE FROM `clinics` WHERE `clinics`.`id` = 1